<template>
  <div>
    <div class="detail">
      {{ showData }}
      <a href="#" @click="fn">{{text}}</a>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      // 数据源
      data: `刘德华（Andy Lau），1961年9月27日出生于中国香港，籍贯广东新会 [1]  ，中国香港男演员、歌手、作词人、制片人。
1981年出演电影处女作《彩云曲》 [2]  。1983年主演的武侠剧《神雕侠侣》在香港获得62点的收视纪录 [3-4]  。1991年创办天幕电影公司 [5]  。1992年，凭借传记片《五亿探长雷洛传》获第11届香港电影金像奖最佳男主角提名 [6]  。1994年担任剧情片《天与地》的制片人 [7]  。2000年凭借警匪片《暗战》获第19届香港电影金像奖最佳男主角奖 [8]  。2004年凭借警匪片《无间道3：终极无间》获第41届台湾金马奖最佳男主角奖 [9]  。2005年获得香港UA院线颁发的全港最高累积票房香港男演员”奖 [10]  。2006年获得釜山国际电影节亚洲最有贡献电影人奖 [11]  。2011年主演剧情片《桃姐》，并凭借该片获台湾金马奖最佳男主角奖、香港电影金像奖最佳男主角奖 [12]  ；担任第49届台湾电影金马奖评审团主席 [13]  。2017年主演警匪动作片《拆弹专家》 [14]  ；获世界杰出华人奖。 [15] 
1985年发行首张个人专辑《只知道此刻爱你》 [16]  。1990年凭借专辑《可不可以》在歌坛获得关注 [17]  。1994年获得十大劲歌金曲最受欢迎男歌星奖。1995年在央视春晚上演唱歌曲《忘情水》 [18]  。2000年被《吉尼斯世界纪录大全》评为“获奖最多的香港男歌手” [19]  。2004年第六次获得十大劲歌金曲最受欢迎男歌星奖。2016年参与填词的歌曲《原谅我》正式发行 [20]  。
1994年创立刘德华慈善基金会 [21]  。2000年被评为世界十大杰出青年 [22]  。2005年发起亚洲新星导计划 [23]  。2008年被委任为香港非官守太平绅士 [24]  。2016年连任中国残疾人福利基金会副理事长。 [22] `,
      // 显示数据
      showData: '',
      // 按钮上显示的文本
      text: '展开',
      // 标识：标识当前内容是否展开
      isShow: false
    }
  },
  // 当页面加载时，会从 data 中截取部分文本
  mounted() {
    // 从 data 中截取60个字符给 showData
    this.showData = this.data.substring(0, 68) + '...'
    console.log(this.showData)
  },
  methods: {
    fn() {
      if (this.isShow === false) {
        // 将完整的数据赋值给 showData
        this.showData = this.data
        // 将文本改为收起
        this.text = '收起'
        this.isShow = true
      } else {
        // 说明内容处理展开状态，需要收起
        this.showData = this.data.substring(0, 68) + '...'
        this.text = '展开'
        this.isShow = false
      }
    }
  }
}
</script>
 
<style>
.detail {
  width: 90%;
  margin: 0 auto;
  border: 1px solid #ccc;
}

.detail a {
  display: inline-block;
  color: green;
}
</style>
